[
    {
        "question": "Which island was the 19th-century French Impressionist painter Camille Pissarro born on?"
    },
    {
        "question": "Which animal has the largest heart relative to its body weight?"
    },
    {
        "question": "What is the deepest trench in the world, and what is the approximate depth of its deepest point?"
    },
    {
        "question": "In ancient Greek mythology, who is the goddess of agriculture and harvest?"
    },
    {
        "question": "Who was the first woman in history to win the Nobel Prize in Physics?"
    },
    {
        "question": "What is the element with an atomic number of 51 in the periodic table, and what are its properties?"
    },
    {
        "question": "What is the largest peninsula in the world, and what is its approximate area?"
    },
    {
        "question": "Among the eight planets in the solar system, which one has the longest rotation period?"
    },
    {
        "question": "In which year was Mozart's opera *Don Giovanni* first performed?"
    },
    {
        "question": "Among the four famous ancient bridges in China, which one is located in Zhao County, Hebei Province?"
    },
    {
        "question": "Which plant has one of the smallest seeds in the world?"
    },
    {
        "question": "Which river flows through the most countries in the world, and how many countries does it pass through?"
    },
    {
        "question": "In which country did the European Renaissance first begin?"
    },
    {
        "question": "What is the most abundant trace element in the human body?"
    },
    {
        "question": "What is China's first chronological biographical history book that focuses on a single dynasty?"
    },
    {
        "question": "What is the smallest sovereign country in the world, and what is its area?"
    },
    {
        "question": "What is the second most abundant gas in Earth's atmosphere?"
    },
    {
        "question": "Which scientist discovered the phenomenon of electromagnetic induction?"
    },
    {
        "question": "Which is the largest pyramid among the ancient Egyptian pyramids?"
    },
    {
        "question": "What is the largest freshwater lake in the world, and what is its approximate area?"
    },
    {
        "question": "Which bird has the fastest flight speed, and what is its speed in kilometers per hour?"
    },
    {
        "question": "In ancient Chinese mythology, who was the figure that created the world by separating heaven and earth?"
    },
    {
        "question": "In which country did the world's earliest paper money appear, and what was its name?"
    },
    {
        "question": "In chemistry, which two acids make up 'aqua regia'?"
    },
    {
        "question": "Which mammal has the shortest gestation period?"
    },
    {
        "question": "What is the waterfall with the largest drop in the world, and what is its drop height?"
    },
    {
        "question": "For whom was India's famous ancient building, the Taj Mahal, built?"
    },
    {
        "question": "In computing, how many gigabytes (GB) are equal to 1 terabyte (TB)?"
    },
    {
        "question": "Which plant is known as the 'ship of the desert'?"
    },
    {
        "question": "What is the largest island in the world, and what is its approximate area?"
    },
    {
        "question": "Who invented the spinning jenny during the 18th-century British Industrial Revolution?"
    },
    {
        "question": "Where is the world's largest coral reef system located, and what is its name?"
    },
    {
        "question": "What is the normal temperature range of the human body in Celsius?"
    },
    {
        "question": "Which animal has three hearts?"
    },
    {
        "question": "In which dynasty did China's ancient imperial examination system begin?"
    },
    {
        "question": "What is the largest desert in the world, and what is its approximate area?"
    },
    {
        "question": "Which insect has the most compound eyes?"
    },
    {
        "question": "Who composed the famous *Symphony No. 5 in C Minor (Destiny)*?"
    },
    {
        "question": "What is the largest landlocked country in the world, and what is its area?"
    },
    {
        "question": "Approximately how many days does it take for the Earth to complete one orbit around the Sun?"
    },
    {
        "question": "What do the 'Four Treasures of the Study' refer to in ancient China?"
    },
    {
        "question": "Which metal has the best electrical conductivity?"
    },
    {
        "question": "On which continent is the world's largest tropical rainforest located, and what is its name?"
    },
    {
        "question": "Who was the first astronaut to go into space, and which country did they come from?"
    },
    {
        "question": "What is the oldest writing system in the world?"
    },
    {
        "question": "Which fruit has the highest vitamin C content?"
    },
    {
        "question": "Among the planets in the solar system, which one has the most moons?"
    },
    {
        "question": "Which of the four great classical novels of ancient China is a mythological novel?"
    },
    {
        "question": "What is the longest mountain range in the world, and what is its approximate length?"
    },
    {
        "question": "Which animal has the longest sleep time?"
    },
    {
        "question": "In which country was the world's earliest Olympic Games held?"
    },
    {
        "question": "Which element is the most abundant metal element on Earth?"
    },
    {
        "question": "What is the deepest freshwater lake in the world, and what is its approximate depth?"
    },
    {
        "question": "Which plant can release oxygen at night?"
    },
    {
        "question": "Among China's ancient 'Four Great Inventions,' which one was used for indicating direction?"
    },
    {
        "question": "What is the largest plain in the world, and what is its approximate area?"
    },
    {
        "question": "Which country was the famous painter Leonardo da Vinci from?"
    },
    {
        "question": "What is the largest organ of the human body?"
    },
    {
        "question": "Which animal has the largest eyes?"
    },
    {
        "question": "What is the largest country in the world by area, and what is its area?"
    },
    {
        "question": "Which plant has the largest flowers?"
    },
    {
        "question": "What was the earliest dinosaur to appear in the world?"
    },
    {
        "question": "What is the largest archipelago in the world, and how many islands does it consist of?"
    },
    {
        "question": "What are the 'Four Books' in ancient Chinese culture?"
    },
    {
        "question": "Which gas is one of the main causes of acid rain?"
    },
    {
        "question": "What is the largest library in the world, and how many books does it hold?"
    },
    {
        "question": "Among the eight planets in the solar system, which one has the lowest density?"
    },
    {
        "question": "Which bird is the most capable of mimicking human speech in the world?"
    },
    {
        "question": "What is the largest palace in the world, and what is its floor area?"
    },
    {
        "question": "Which animal has the most teeth?"
    },
    {
        "question": "Which ancient Chinese poet was known as the 'Poetic Genius'?"
    },
    {
        "question": "What is the largest ocean in the world, and what is its approximate area?"
    },
    {
        "question": "Which plant has the longest lifespan?"
    },
    {
        "question": "In which year did World War I break out in history?"
    },
    {
        "question": "What is the largest church in the world, and where is it located?"
    },
    {
        "question": "How many bones are there in the human skeleton?"
    },
    {
        "question": "Which animal has the largest ears?"
    },
    {
        "question": "What is the largest port in the world, and what is its annual cargo throughput?"
    },
    {
        "question": "Which ancient Chinese calligrapher was known as the 'Sage of Calligraphy'?"
    },
    {
        "question": "What is the smallest bird in the world, and what is its approximate weight?"
    },
    {
        "question": "Which plant is one of the fastest-growing plants in the world?"
    },
    {
        "question": "What is the largest inland lake in the world, and what is its approximate area?"
    },
    {
        "question": "Which animal has the longest tail?"
    },
    {
        "question": "Who is depicted in the famous painting *Mona Lisa*?"
    },
    {
        "question": "What is the name of the largest diamond in the world, and how many carats does it weigh?"
    },
    {
        "question": "Which metal has the highest melting point?"
    },
    {
        "question": "What is the largest football stadium in the world, and how many people can it hold?"
    },
    {
        "question": "Which mountain is the leader of the 'Five Great Mountains' (Wuyue) in ancient China?"
    },
    {
        "question": "Which animal has the fastest running speed, and what is its speed in kilometers per hour?"
    },
    {
        "question": "What is the largest basin in the world, and what is its approximate area?"
    },
    {
        "question": "Which plant is one of the most drought-tolerant plants in the world?"
    },
    {
        "question": "During which dynasty did the world's earliest paper money appear in China?"
    },
    {
        "question": "Which animal is one of the most intelligent animals in the world?"
    },
    {
        "question": "What is the largest art museum in the world, and how many works of art does it house?"
    },
    {
        "question": "Among the eight planets in the solar system, which one has the highest surface temperature?"
    },
    {
        "question": "Which bird has the longest migration distance?"
    },
    {
        "question": "What is the largest square in the world, and what is its area?"
    },
    {
        "question": "Which plant's seeds can survive underground for the longest time?"
    },
    {
        "question": "Which ancient Chinese thinker proposed the doctrine of 'Ren' (benevolence)?"
    },
    {
        "question": "What is the largest volcano in the world, and where is it located?"
    },
    {
        "question": "Which animal has the most sensitive sense of smell?"
    },
    {
        "question": "Where is the world's largest group of desert lakes located, and what is its name?"
    },
    {
        "question": "Which plant has the largest leaves?"
    },
    {
        "question": "Which country was the famous physicist Albert Einstein born in?"
    },
    {
        "question": "What is the largest canyon in the world, and what is its approximate depth?"
    },
    {
        "question": "What is the most abundant metal element in the human body?"
    },
    {
        "question": "Which animal has the longest tongue?"
    },
    {
        "question": "What is the largest ice shelf in the world, and what is its approximate area?"
    },
    {
        "question": "Among the four famous ancient towers in China, which one is located in Yueyang, Hunan Province?"
    },
    {
        "question": "Which plant's flowers are among the most fragrant in the world?"
    },
    {
        "question": "In which year was the world's earliest computer invented?"
    },
    {
        "question": "Which animal is one of the most cold-tolerant animals in the world?"
    },
    {
        "question": "What is the largest zoo in the world, and what is its area?"
    },
    {
        "question": "Among the eight planets in the solar system, which one has the largest axial tilt angle?"
    },
    {
        "question": "Which bird flies the highest in the world?"
    },
    {
        "question": "What is the largest peninsula desert in the world, and what is its approximate area?"
    },
    {
        "question": "Which plant is one of the most poisonous plants in the world?"
    },
    {
        "question": "Which ancient Chinese military strategist wrote *The Art of War*?"
    },
    {
        "question": "Where is the world's largest impact crater located, and what is its diameter?"
    },
    {
        "question": "Which animal has the slowest heart rate?"
    },
    {
        "question": "What is the largest inland delta in the world, and what is its approximate area?"
    },
    {
        "question": "Which plant produces the heaviest fruit in the world?"
    },
    {
        "question": "Who wrote the famous *On the Origin of Species*?"
    },
    {
        "question": "What is the largest coral island in the world, and what is its area?"
    },
    {
        "question": "Which organ in the human body has the highest water content?"
    },
    {
        "question": "Which animal has the best memory?"
    },
    {
        "question": "What is the largest cave in the world, and what is its approximate length?"
    },
    {
        "question": "Who are the 'Three Sovereigns' (Sanhuang) among the 'Three Sovereigns and Five Emperors' in ancient Chinese mythology?"
    },
    {
        "question": "Which plant has the longest roots in the world?"
    },
    {
        "question": "What is the oldest university in the world, and where is it located?"
    },
    {
        "question": "Which animal has the most acute sense of hearing?"
    },
    {
        "question": "What is the largest archipelagic country in the world, and how many islands does it consist of?"
    },
    {
        "question": "Which plant has one of the smallest pollens in the world?"
    },
    {
        "question": "Which country was the famous astronomer Nicolaus Copernicus from?"
    },
    {
        "question": "What is the largest glacier in the world, and what is its approximate area?"
    },
    {
        "question": "Which organ in the human body has the strongest regenerative ability?"
    },
    {
        "question": "Which animal has the best eyesight?"
    },
    {
        "question": "What is the largest saltwater lake in the world, and what is its approximate area?"
    },
    {
        "question": "What do the 'Five Elements' (Wuxing) refer to in ancient Chinese culture?"
    },
    {
        "question": "Which plant has the highest nectar production?"
    },
    {
        "question": "In which year was the world's first stamp issued, and what was its name?"
    },
    {
        "question": "Which animal is one of the most heat-tolerant animals in the world?"
    },
    {
        "question": "What is the largest railway station in the world, and what is its floor area?"
    },
    {
        "question": "Among the eight planets in the solar system, which one has the reddest color?"
    },
    {
        "question": "Which bird is the most skilled at fishing in the world?"
    },
    {
        "question": "What is the largest freshwater wetland in the world, and what is its approximate area?"
    },
    {
        "question": "Which plant has the thickest bark in the world?"
    },
    {
        "question": "Which ancient Chinese poet was known as the 'Poetic Sage'?"
    },
    {
        "question": "What is the largest man-made building in the world, and what is its approximate length?"
    },
    {
        "question": "Which animal has the largest brain capacity?"
    },
    {
        "question": "What is the name of the largest meteorite in the world, and what is its weight?"
    },
    {
        "question": "Which metal has the best ductility?"
    },
    {
        "question": "What is the largest stadium in the world, and how many people can it hold?"
    },
    {
        "question": "What do the 'Eight Trigrams' (Bagua) in ancient Chinese culture each represent?"
    },
    {
        "question": "Which animal has the longest lifespan?"
    },
    {
        "question": "What is the largest salt lake in the world, and what is its approximate area?"
    },
    {
        "question": "Which plant's flowers are among the most beautiful in the world?"
    },
    {
        "question": "In which year was the world's earliest bank founded, and where was it located?"
    },
    {
        "question": "Which animal is one of the most skilled at camouflage in the world?"
    },
    {
        "question": "What is the largest art palace in the world, and how many works of art does it house?"
    },
    {
        "question": "Among the eight planets in the solar system, which one has the fewest moons?"
    },
    {
        "question": "Which bird is the most skilled at nest-building in the world?"
    },
    {
        "question": "What is the largest plateau in the world, and what is its approximate area?"
    },
    {
        "question": "Which plant has one of the heaviest seeds in the world?"
    },
    {
        "question": "Which ancient Chinese thinker proposed the ideas of 'Universal Love' (Jian'ai) and 'Non-Aggression' (Feigong)?"
    },
    {
        "question": "What is the largest waterfall group in the world, and how many waterfalls does it consist of?"
    },
    {
        "question": "Which animal has the densest fur?"
    },
    {
        "question": "Where is the world's largest underground cave system located, and what is its approximate length?"
    },
    {
        "question": "Which plant has one of the smallest leaves in the world?"
    },
    {
        "question": "Which country was the famous painter Vincent van Gogh from?"
    },
    {
        "question": "What is the largest mid-ocean ridge in the world, and what is its approximate length?"
    },
    {
        "question": "Which organ in the human body has the most complex functions?"
    },
    {
        "question": "Which animal has the strongest ability to change speed?"
    },
    {
        "question": "What is the largest volcanic crater in the world, and what is its diameter?"
    },
    {
        "question": "Among the 'Four Great Beauties' of ancient China, who lived during the Western Han Dynasty?"
    },
    {
        "question": "Which plant produces one of the most peculiar fruits in the world?"
    },
    {
        "question": "In which year did the world's earliest newspaper appear, and what was its name?"
    },
    {
        "question": "Which animal is one of the most skilled at swimming in the world?"
    },
    {
        "question": "What is the largest airport in the world, and what is its annual passenger throughput?"
    },
    {
        "question": "Among the eight planets in the solar system, which one has the weakest surface gravity?"
    },
    {
        "question": "Which bird is the most skilled at singing in the world?"
    },
    {
        "question": "What is the largest desert oasis in the world, and what is its approximate area?"
    },
    {
        "question": "Which plant has one of the most peculiar roots in the world?"
    },
    {
        "question": "Which ancient Chinese calligrapher's style is known as 'Yan Style'?"
    },
    {
        "question": "Where is the world's largest group of impact craters located, and how many craters does it consist of?"
    },
    {
        "question": "Which animal has the most heartbeats per minute?"
    },
    {
        "question": "What is the largest delta in the world, and what is its approximate area?"
    },
    {
        "question": "Which plant's flowers are among the rarest in the world?"
    },
    {
        "question": "Who wrote the famous *War and Peace*?"
    },
    {
        "question": "What is the largest coral atoll in the world, and what is its area?"
    },
    {
        "question": "Which organ in the human body has the lightest weight?"
    },
    {
        "question": "Which animal has the strongest adaptability?"
    },
    {
        "question": "What is the largest cave hall in the world, and what is its approximate area?"
    },
    {
        "question": "What do the 'Five Constant Virtues' (Wuchang) refer to in the 'Three Cardinal Guides and Five Constant Virtues' of ancient China?"
    },
    {
        "question": "Which plant has one of the largest pollens in the world?"
    },
    {
        "question": "In which region did the world's earliest paper money appear?"
    },
    {
        "question": "Which animal is one of the most skilled at climbing in the world?"
    },
    {
        "question": "What is the largest inland salt lake in the world, and what is its approximate area?"
    },
    {
        "question": "Which plant has one of the most peculiar leaves in the world?"
    },
    {
        "question": "Which country was the famous physicist Isaac Newton from?"
    },
    {
        "question": "What animal image is the mascot of the 1972 Munich Olympics?"
    },
    {
        "question": "For the famous Italian painter Caravaggio, where does the light source in his painting *The Calling of St. Matthew* come from?"
    },
    {
        "question": "Which is the smallest ocean in the world, and what is its approximate area?"
    },
    {
        "question": "What is the third most abundant trace element in the human body?"
    },
    {
        "question": "What are the specific 'Five Precepts' of ancient Indian Buddhism?"
    },
    {
        "question": "During which period did the face-changing technique of Sichuan Opera, a traditional Chinese opera, originate?"
    },
    {
        "question": "Which plant has the most diverse flower colors?"
    },
    {
        "question": "Who was the navigator of the first circumnavigation in history, and how long did his fleet take to complete the voyage?"
    },
    {
        "question": "Which planet is adjacent to Earth's orbit on the inner side in the solar system, and what is its orbital period approximately in days?"
    },
    {
        "question": "How tall can the largest cactus in the world grow?"
    },
    {
        "question": "For the famous writer Jane Austen, what was the original manuscript title of her work *Pride and Prejudice*?"
    },
    {
        "question": "Which animal has the sharpest claws, and what is the maximum length of its claws?"
    },
    {
        "question": "Among the 'Twenty-Four Solar Terms' in ancient China, which solar term comes after 'Grain Buds' (Xiaoman)?"
    },
    {
        "question": "Which is the oldest university library in the world, and in which country is it located?"
    },
    {
        "question": "Which element in the periodic table has the lowest boiling point?"
    },
    {
        "question": "Which bird uses tools to obtain food, and what tools do they commonly use?"
    },
    {
        "question": "Where is the largest hot spring in the world, and what is the maximum water temperature there?"
    },
    {
        "question": "Which ancient Chinese poet wrote the poem *Farewell to Chuzhou* (*Bie Chu*)?"
    },
    {
        "question": "In ancient Greek mythology, who is the god in charge of commerce, travelers, thieves, and animal husbandry?"
    },
    {
        "question": "Which is the largest island country in the world, and how many islands is it composed of?"
    },
    {
        "question": "Approximately how many meters long is the small intestine in the human body?"
    },
    {
        "question": "Which plant can predict weather changes, and how does it do so?"
    },
    {
        "question": "In which country was the first surgical operation using anesthetics performed in history, and who performed it?"
    },
    {
        "question": "Which is the deepest subway station in the world, in which city is it located, and what is its depth?"
    },
    {
        "question": "Which animal has a skeletal structure most suitable for long-term flight?"
    },
    {
        "question": "Among the 'Four Famous Inkstones' in ancient China, which one is produced in Zhaoqing, Guangdong?"
    },
    {
        "question": "Where is the largest grape-growing area in the world, and what is the approximate annual grape output there?"
    },
    {
        "question": "What musical instrument was the famous musician Chopin most skilled at playing?"
    },
    {
        "question": "Which insect has its auditory organs on its legs?"
    },
    {
        "question": "Which is the earliest skyscraper in the world, and in which year was it built?"
    },
    {
        "question": "In ancient Chinese mythology, from whom did Jingwei, the bird in the story 'Jingwei Fills the Sea', transform?"
    },
    {
        "question": "How large can the largest jellyfish in the world be, and what is the maximum length of its tentacles?"
    },
    {
        "question": "Approximately how many days is the lifespan of red blood cells in human blood?"
    },
    {
        "question": "Which plant's seeds can float in water for the longest time?"
    },
    {
        "question": "Which emperor in history implemented the 'Edict of Enfeoffment' (*Tui'en Ling*)?"
    },
    {
        "question": "Where is the largest underground river in the world, and what is its length?"
    },
    {
        "question": "Which animal has an eye structure most similar to that of humans?"
    },
    {
        "question": "What skill does 'Yu' (御) refer to among the 'Six Arts' (*Liu Yi*) in ancient China?"
    },
    {
        "question": "Where is the largest meteorite museum in the world, and how many meteorites are collected there?"
    },
    {
        "question": "What is the real name of the famous writer Mark Twain?"
    },
    {
        "question": "Which plant's stem can store a large amount of water?"
    },
    {
        "question": "Which is the largest inland river in the world, and what is its approximate length?"
    },
    {
        "question": "Which part of the human body has the strongest muscles?"
    },
    {
        "question": "Which animal's offspring has the lightest birth weight?"
    },
    {
        "question": "Which ancient Chinese calligrapher created the 'Slender Gold Style' (*Shoujin Ti*)?"
    },
    {
        "question": "Where is the largest Ferris wheel in the world, and what is its diameter?"
    },
    {
        "question": "Which plant's flowers have the shortest blooming time?"
    },
    {
        "question": "Who improved the steam engine during the first Industrial Revolution in history?"
    },
    {
        "question": "Where is the largest bird sanctuary in the world, and what is its area?"
    },
    {
        "question": "Which animal's tail can regenerate, and how does the regeneration happen?"
    },
    {
        "question": "In the 'Mutual Generation of the Five Elements' (*Wuxing Xiangsheng*) in ancient China, after 'Metal generates Water', what does Water generate?"
    },
    {
        "question": "Which is the largest art gallery in the world, and how many paintings are collected there?"
    },
    {
        "question": "For the famous painter Monet, which port's scenery is depicted in his painting *Impression, Sunrise*?"
    },
    {
        "question": "Which plant's leaves can be used as a natural hemostatic?"
    },
    {
        "question": "Which is the deepest sea in the world, and what is its average depth approximately in meters?"
    },
    {
        "question": "What is the most abundant organic compound in the human body?"
    },
    {
        "question": "Which animal has the largest ratio of brain weight to body weight?"
    },
    {
        "question": "Among the 'Four Famous Academies' (*Sida Shuyuan*) in ancient China, which one is located in Changsha, Hunan?"
    },
    {
        "question": "Where is the largest bell in the world, and what is its weight?"
    },
    {
        "question": "Which plant's fruits can purify sewage, and how does it purify?"
    },
    {
        "question": "Which scientist in history discovered radium?"
    },
    {
        "question": "What is the area of the largest football field lawn in the world?"
    },
    {
        "question": "Which animal's saliva contains special antibacterial components?"
    },
    {
        "question": "What do the 'Three Cardinal Guides' (*Sangang*) refer to in ancient China?"
    },
    {
        "question": "Which is the largest salt lake city in the world, and what is its area?"
    },
    {
        "question": "For the famous writer Tolstoy, along which two storylines does his masterpiece *Anna Karenina* unfold?"
    },
    {
        "question": "Which plant's flowers bloom at night and have a strong fragrance?"
    },
    {
        "question": "Where is the largest desert highway in the world, and what is its length?"
    },
    {
        "question": "Which organ in the human body has the densest nerve distribution?"
    },
    {
        "question": "Which animal's ears can rotate independently, and what is the rotation range in degrees?"
    },
    {
        "question": "In the 'Imperial Examination System' (*Keju*) in ancient China, what was the first-place winner of the Palace Examination (*Dianshi*) called?"
    },
    {
        "question": "Where is the largest astronomical telescope in the world, and what is its aperture?"
    },
    {
        "question": "Which plant's pollen can travel the farthest distance?"
    },
    {
        "question": "In which country was the first automobile race in history held, and in which year?"
    },
    {
        "question": "How large can the largest freshwater fish in the world grow, and what is its weight?"
    },
    {
        "question": "Which animal's horns are the most ornamental, and what is unique about its horns?"
    },
    {
        "question": "Among the 'Four Famous Embroidery Styles' (*Sida Mingxiu*) in ancient China, what are the main characteristics of Suzhou Embroidery (*Suxiu*)?"
    },
    {
        "question": "Which is the largest waterfall in the world, and what is its water flow per second?"
    },
    {
        "question": "For the famous painter Picasso, which of his paintings reflects the cruelty of war?"
    },
    {
        "question": "Which plant's roots can be used as medicine, and what diseases can it treat?"
    },
    {
        "question": "Which is the largest palace complex in the world, and what is its floor area?"
    },
    {
        "question": "Which organ in the human body is most prone to developing stones?"
    },
    {
        "question": "Which animal's fur is the warmest, and why?"
    },
    {
        "question": "What are the 'Five Classics' (*Wujing*) among the 'Four Books and Five Classics' (*Sishu Wujing*) in ancient China?"
    },
    {
        "question": "Where is the largest railway tunnel in the world, and what is its length?"
    },
    {
        "question": "Which plant's leaves can absorb harmful gases in the air, and what is the effect?"
    },
    {
        "question": "Which emperor in history was known as the 'Carpenter Emperor'?"
    },
    {
        "question": "Where is the largest opera house in the world, and how many audiences can it accommodate?"
    },
    {
        "question": "Which animal's tongue can stretch the longest, and how many times the length of its body can it reach?"
    },
    {
        "question": "In the 'Mutual Restraint of the Five Elements' (*Wuxing Xiangke*) in ancient China, what does Fire restrain?"
    },
    {
        "question": "Where is the largest glacial lake in the world, and what is its area?"
    },
    {
        "question": "For the famous writer Cao Xueqin, were the authors of the first 80 chapters and the last 40 chapters of his *Dream of the Red Chamber* the same?"
    },
    {
        "question": "Which plant's seeds germinate the fastest, and how long does it take?"
    },
    {
        "question": "Which is the largest inland basin in the world, and what is its approximate area?"
    },
    {
        "question": "Which organ in the human body has relatively weak self-repair ability?"
    },
    {
        "question": "Which animal's teeth are the hardest, and what objects can they crush?"
    },
    {
        "question": "What do the 'Six Etiquettes' (*Liuli*) refer to in marriage in ancient China?"
    },
    {
        "question": "Where is the largest Ferris wheel park in the world, and how many Ferris wheels are there in the park?"
    },
    {
        "question": "Which plant's flowers are edible, and what nutritional value do they have?"
    },
    {
        "question": "Which scientist in history proposed the 'heliocentric theory'?"
    },
    {
        "question": "How large can the largest freshwater lobster in the world grow, and what is its weight?"
    },
    {
        "question": "Which animal's call can travel the farthest distance, and how far can it travel?"
    },
    {
        "question": "In which province is the Guanque Tower, one of the 'Four Famous Towers' (*Sida Minglou*) in ancient China, located?"
    },
    {
        "question": "Where is the largest meteorite crater lake in the world, and what is its diameter?"
    },
    {
        "question": "Besides painting, in which other fields was the famous painter Da Vinci skilled?"
    },
    {
        "question": "Which plant's stem can be used to make musical instruments, and what kind of musical instruments are made?"
    },
    {
        "question": "Where is the largest underground karst cave in the world, and what is its spatial volume?"
    },
    {
        "question": "Which organ in the human body has the highest temperature?"
    },
    {
        "question": "Which animal's sense of smell can track prey deep underground?"
    },
    {
        "question": "During which dynasty was the 'Imperial Examination System' (*Keju*) abolished in ancient China?"
    },
    {
        "question": "Where is the largest planetarium in the world, and what is its building area?"
    },
    {
        "question": "Which plant's fruits can be used to make natural dyes, and what color can they dye?"
    },
    {
        "question": "How was the distance of the first marathon race in history determined?"
    },
    {
        "question": "Where is the largest salt mine in the world, and what is its reserve?"
    },
    {
        "question": "Which animal's eyes can see ultraviolet light?"
    },
    {
        "question": "Among the 'Four Treasures of the Study' (*Wenfang Sibao*) in ancient China, where is rice paper (*Xuanzhi*) mainly produced?"
    },
    {
        "question": "Where is the largest sculpture park in the world, and how many sculptures are there in the park?"
    },
    {
        "question": "Which work of the famous writer Dickens is set against the background of the French Revolution?"
    },
    {
        "question": "Which plant has the most peculiar leaf shape, and what is peculiar about it?"
    },
    {
        "question": "Where is the largest man-made lake in the world, and what is its water storage capacity?"
    },
    {
        "question": "Which organ in the human body continues to work during sleep?"
    },
    {
        "question": "Which animal's blood is not red, and what color is it?"
    },
    {
        "question": "Which is the first historical book among the 'Twenty-Four Histories' (*Ershisi Shi*) in ancient China?"
    },
    {
        "question": "Where is the largest aquarium in the world, and how many species of aquatic organisms are there in it?"
    },
    {
        "question": "Which plant's flowers are one of the sources of the most expensive spices in the world?"
    },
    {
        "question": "Which military strategist in history put forward the military thought of 'Know yourself and know your enemy, and you can fight a hundred battles without defeat'?"
    },
    {
        "question": "What is the largest bridge span in the world, and where is this bridge located?"
    },
    {
        "question": "Which animal's offspring grow the fastest, and how long does it take from birth to adulthood?"
    },
    {
        "question": "Who are the 'Five Emperors' (*Wudi*) usually referred to in the 'Three Sovereigns and Five Emperors' (*Sanhuang Wudi*) in ancient China?"
    },
    {
        "question": "Where is the largest bird specimen museum in the world, and how many species of bird specimens are collected there?"
    },
    {
        "question": "What are the main colors used in the famous painter Van Gogh's painting *The Starry Night*?"
    },
    {
        "question": "Which plant's roots can fix quicksand, and what is the principle of sand fixation?"
    },
    {
        "question": "Where is the largest underground palace in the world, and what is its scale?"
    },
    {
        "question": "Which organ in the human body is responsible for filtering waste from the blood?"
    },
    {
        "question": "How long did Queen Victoria of the United Kingdom reign in the 19th century?"
    },
    {
        "question": "What is the height of the Great Pyramid of Giza (Khufu Pyramid) in the ancient Egyptian pyramids, accurate to two decimal places, in meters?"
    },
    {
        "question": "In which year was Mozart's opera *Don Giovanni* first performed?"
    },
    {
        "question": "What is the specific depth of the deepest part of the Mariana Trench, the deepest trench in the world, in meters?"
    },
    {
        "question": "Which families are mainly depicted in the novel *War and Peace*?"
    },
    {
        "question": "How many islands make up Indonesia, the world's largest archipelagic country?"
    },
    {
        "question": "In which city (at that time) was the starting point of the 'Silk Road' in ancient China?"
    },
    {
        "question": "What is the atomic number of caesium in the periodic table of elements?"
    },
    {
        "question": "For what original purpose was the Louvre in France built?"
    },
    {
        "question": "In ancient Greek mythology, where was Aphrodite, the goddess of love, born?"
    },
    {
        "question": "Who invented the world's first movable type printing technology, and what material was used?"
    },
    {
        "question": "What is the specific area of the Sahara Desert, the largest desert in the world, accurate to 10,000 square kilometers?"
    },
    {
        "question": "How many carpal bones are there in the human body?"
    },
    {
        "question": "Among Shakespeare's Four Great Tragedies, in which country is the story of *Macbeth* set?"
    },
    {
        "question": "How many moons does Uranus have in the solar system?"
    },
    {
        "question": "Which specific school did Tai Chi, a traditional Chinese martial art, originate from?"
    },
    {
        "question": "What is the world's highest volcano, and what is its elevation in meters?"
    },
    {
        "question": "Which city's scene is depicted in *Along the River During the Qingming Festival* by Zhang Zeduan, a painter of the Northern Song Dynasty?"
    },
    {
        "question": "By what area has the snow cap of Mount Kilimanjaro, the highest peak in Africa, shrunk in the past decade due to global warming?"
    },
    {
        "question": "In which present-day countries was the ancient Maya civilization mainly distributed?"
    },
    {
        "question": "What is the world's smallest mammal, and what is its approximate weight in grams?"
    },
    {
        "question": "Besides Leonardo da Vinci, who were the representative painters of the Florentine School during the European Renaissance?"
    },
    {
        "question": "In which city is Yunjin, one of the 'Four Famous Brocades' in ancient China, mainly produced?"
    },
    {
        "question": "What is the total length of the Volga River, the longest inland river in the world, in kilometers?"
    },
    {
        "question": "Through the hybridization experiments of which plant did Gregor Mendel, the father of modern genetics, discover the laws of inheritance?"
    },
    {
        "question": "What is the world's largest Gothic church, and in which city is it located?"
    },
    {
        "question": "In the imperial examination system of ancient China, 'Lianzhong Sanyuan' (winning first place in three consecutive examinations) refers to obtaining the first place in which examinations?"
    },
    {
        "question": "Among the eight planets in the solar system, which one has the longest rotation period, and what is its rotation period in days?"
    },
    {
        "question": "What is the area of the Arabian Peninsula, the largest peninsula in the world, accurate to 10,000 square kilometers?"
    },
    {
        "question": "What was the inspiration for Beethoven's *Moonlight Sonata*?"
    },
    {
        "question": "What is the largest lymphoid organ in the human lymphatic system?"
    },
    {
        "question": "In which year was the world's first successful heart transplant surgery performed, and who performed it?"
    },
    {
        "question": "What is the average depth of Lake Baikal, the deepest freshwater lake in the world, in meters?"
    },
    {
        "question": "In ancient Chinese mythology, where on the moon did Chang'e live after flying to the moon?"
    },
    {
        "question": "During which dynasty and in which region of China did 'Jiaozi', the world's earliest paper money, appear?"
    },
    {
        "question": "In plant photosynthesis, which substance is the source of the oxygen produced in the light-dependent reaction stage?"
    },
    {
        "question": "Who is the prototype figure of Michelangelo's famous sculpture *David*?"
    },
    {
        "question": "What is the water storage capacity of Lake Superior, the largest freshwater lake in the world, in cubic kilometers?"
    },
    {
        "question": "What specific etiquette norms are included in 'Li' (Rites), one of the 'Six Arts' in ancient China?"
    },
    {
        "question": "What is the world's largest butterfly species, and what is the maximum wingspan length in centimeters?"
    },
    {
        "question": "What is the name of the academy founded by the famous ancient Greek philosopher Plato?"
    },
    {
        "question": "What is the area of Kazakhstan, the world's largest landlocked country, accurate to 10,000 square kilometers?"
    },
    {
        "question": "Into how many types are white blood cells in human blood divided, and what are the functions of each type?"
    },
    {
        "question": "In which year did the first successful flight across the English Channel take place, and who piloted the aircraft?"
    },
    {
        "question": "Which countries' territories are partially covered by the Amazon Rainforest, the world's largest tropical rainforest?"
    },
    {
        "question": "In *Journey to the West*, one of the 'Four Great Classical Novels' of ancient China, how many hardships did Tang Seng and his three disciples experience during their journey to obtain the Buddhist scriptures?"
    },
    {
        "question": "In which country is the Great Barrier Reef, the world's largest coral reef system, located, and what is its approximate length in kilometers?"
    },
    {
        "question": "In Charles Dickens' novel *Oliver Twist*, where was the protagonist Oliver born?"
    },
    {
        "question": "Between which two planets in the solar system is the asteroid belt located?"
    },
    {
        "question": "What are the stroke characteristics of 'Shoujin Ti' (Slender Gold Style), a calligraphic style in ancient China?"
    },
    {
        "question": "In which country is the Salar de Uyuni, the world's largest salt flat, located, and what is its area in square kilometers?"
    },
    {
        "question": "For whom did the famous musician Johann Sebastian Bach originally compose *The Goldberg Variations*?"
    },
    {
        "question": "Which part of the human body has the thinnest skin, and what is its approximate thickness in millimeters?"
    },
    {
        "question": "Which expedition team was the first to successfully reach the Antarctic continent in history, and when did this happen?"
    },
    {
        "question": "Is the water in the Caspian Sea, the world's largest lake, saltwater or freshwater, and what is its area in square kilometers?"
    },
    {
        "question": "What is the meaning of the 'Guyu' (Grain Rain) solar term among the 'Twenty-Four Solar Terms' in ancient China?"
    },
    {
        "question": "What is the world's largest spider species, and what is its maximum weight in grams?"
    },
    {
        "question": "What are the specific contents of the 'Twelve Links of Dependent Origination' in ancient Indian Buddhism?"
    },
    {
        "question": "What is the approximate daily passenger flow of Grand Central Terminal in New York, USA, one of the world's largest railway hubs?"
    },
    {
        "question": "In which province and city of China is the Zuiweng Pavilion located, one of the 'Four Famous Pavilions' in ancient China?"
    },
    {
        "question": "What is the maximum running speed of the ostrich, the world's largest bird, in kilometers per hour?"
    },
    {
        "question": "How many paintings are there in Vincent van Gogh's *Sunflower* series?"
    },
    {
        "question": "Which organ in the human endocrine system secretes insulin?"
    },
    {
        "question": "During the first circumnavigation of the world in history, with whom did Magellan's fleet conflict in the Philippines?"
    },
    {
        "question": "What is the total area of the Malay Archipelago, the world's largest archipelago, accurate to 10,000 square kilometers?"
    },
    {
        "question": "In the 'Five Elements Theory' of ancient China, what color corresponds to 'Jin' (Metal)?"
    },
    {
        "question": "What is the population of Riyadh, the world's largest desert city, accurate to 10,000 people?"
    },
    {
        "question": "In Leo Tolstoy's novel *Resurrection*, where did the male protagonist Nekhlyudov first meet Maslova?"
    },
    {
        "question": "How long has the Great Red Spot on Jupiter persisted in the solar system?"
    },
    {
        "question": "Where is the origin of Huzhou brushes, one of the 'Four Treasures of the Study' in ancient China?"
    },
    {
        "question": "In which country and national park is Old Faithful, the world's largest hot spring geyser, located, and what is its general eruption interval?"
    },
    {
        "question": "For which musical instrument were most of the works of the famous musician Frédéric Chopin composed?"
    },
    {
        "question": "Which organ in the human body has many folds on its surface, and what is the function of these folds?"
    },
    {
        "question": "In which year and at which location was the world's first atomic bomb test explosion conducted?"
    },
    {
        "question": "What is the maximum weight that the Tasmanian giant freshwater crayfish, the world's largest freshwater crayfish, can grow to?"
    },
    {
        "question": "What are the common theories about who the 'Three Sovereigns' (San Huang) were in the 'Three Sovereigns and Five Emperors' of ancient China?"
    },
    {
        "question": "How many species of bird specimens are collected in the American Museum of Natural History, the world's largest bird specimen museum?"
    },
    {
        "question": "What kinds of still life objects often appear in the paintings of the famous painter Paul Cézanne?"
    },
    {
        "question": "In which province of China is the Tenglong Cave, the world's largest underground river cave group, located, and how many caves does it include?"
    },
    {
        "question": "Which part of the human body is the least sensitive to pain, and why?"
    },
    {
        "question": "In which country was the first manned hot air balloon flight in history conducted, who accomplished it, and how far did it fly?"
    },
    {
        "question": "What is the approximate area of the Qaidam Basin, the world's largest inland salt lake basin, in 10,000 square kilometers?"
    },
    {
        "question": "Which animal's ears can help it orientate in water, and how does it do this?"
    },
    {
        "question": "In the imperial examination system of ancient China, what was the second-place winner in the palace examination (Dian Shi) called?"
    },
    {
        "question": "In which country is the Atacama Large Millimeter/submillimeter Array (ALMA), the world's largest astronomical observatory, located, and how many telescopes does it have?"
    },
    {
        "question": "Which plant's stem can be used to make paper, and what are the characteristics of this kind of paper?"
    },
    {
        "question": "Which cultures influenced the famous painter Paul Gauguin in his painting career?"
    },
    {
        "question": "What is the annual output of Domaine de la Romanée-Conti, the world's largest winery, in bottles?"
    },
    {
        "question": "Which plant's seeds can germinate in extremely cold environments, and how does it adapt to low temperatures?"
    },
    {
        "question": "Who conducted the world's first radio communication experiment in history, when was it done, and how far was the signal transmitted?"
    },
    {
        "question": "How many glacial lakes make up the Pangong Tso - Manasarovar lake group, the world's largest glacial lake group?"
    },
    {
        "question": "Which animal's fur color changes with the seasons, and why does this change occur?"
    },
    {
        "question": "What do the 'Six Rites' (Liu Li) refer to in sacrificial rituals in ancient China?"
    },
    {
        "question": "How many pieces of glass art are collected in the Corning Museum of Glass, the world's largest art glass museum?"
    },
    {
        "question": "Which work by the famous writer Victor Hugo created the character Quasimodo?"
    },
    {
        "question": "Which plant's leaves can glow at night, and what is the reason for this glow?"
    },
    {
        "question": "What are the depth and length of the Bahamas Canyon, the world's largest submarine canyon, respectively?"
    },
    {
        "question": "Which organ in the human body is most vulnerable to injury from external impacts?"
    },
    {
        "question": "Which animal's ears can help it orientate in water, and how does it do this?"
    },
    {
        "question": "What is the water flow rate of Niagara Falls, the world's largest waterfall, in cubic meters per second?"
    },
    {
        "question": "In Mark Twain's novel *The Adventures of Tom Sawyer*, in which town does Tom Sawyer live?"
    },
    {
        "question": "What substances mainly compose Saturn's rings in the solar system?"
    },
    {
        "question": "Where is the origin of the stone used for Tao Inkstone, one of the 'Four Famous Inkstones' in ancient China?"
    },
    {
        "question": "What is the maximum height that the saguaro cactus, the world's largest cactus, can grow to in meters?"
    },
    {
        "question": "What are the rhythmic characteristics of Brahms' *Hungarian Dance No. 5*?"
    },
    {
        "question": "What is the main function of alveoli in the human respiratory system?"
    },
    {
        "question": "In which country was the world's first automobile race held, in which year did it take place, and what was the race distance?"
    },
    {
        "question": "What is the length of the Tarim Desert Highway, the world's largest desert highway, in kilometers?"
    },
    {
        "question": "What are the climatic characteristics of the 'Hanlu' (Cold Dew) solar term among the 'Twenty-Four Solar Terms' in ancient China?"
    },
    {
        "question": "What is the approximate annual migration distance of the monarch butterfly, the world's largest butterfly, in kilometers?"
    },
    {
        "question": "What is the weapon of Poseidon, the god of the sea, in ancient Greek mythology?"
    },
    {
        "question": "Which countries does the Volga River, the world's largest inland river, flow through?"
    },
    {
        "question": "What is the second most abundant trace element in the human body?"
    },
    {
        "question": "In which year was the world's first successful kidney transplant surgery performed, and who performed it?"
    },
    {
        "question": "How many years did it take to build Cologne Cathedral, the world's largest Gothic building?"
    },
    {
        "question": "In the 'Five Elements Generation Cycle' (Wu Xing Xiang Sheng) of ancient China, after 'Mu' (Wood) generates 'Huo' (Fire), what does 'Huo' (Fire) generate?"
    },
    {
        "question": "Where is the world's largest coral reef tunnel located, and what is its length in meters?"
    },
    {
        "question": "How many works are included in Honoré de Balzac's *La Comédie Humaine*?"
    },
    {
        "question": "Which plant's roots can absorb heavy metals from the soil, and what is the effect of this absorption?"
    },
    {
        "question": "How many types of volcanic specimens are exhibited in Hawaii Volcanoes National Park, the world's largest volcano museum?"
    },
    {
        "question": "Which organ in the human body is most sensitive to hypoxia?"
    },
    {
        "question": "Which animal's claws help it build complex nests in trees?"
    },
    {
        "question": "What do the 'Five Constant Virtues' (Wu Chang) refer to in the 'Three Cardinal Guides and Five Constant Virtues' (San Gang Wu Chang) of ancient China?"
    },
    {
        "question": "How many species of desert plants are grown in Dubai Miracle Garden, the world's largest desert botanical garden?"
    },
    {
        "question": "Which plant's flowers can be used as a natural insecticide, and what is the principle behind this?"
    },
    {
        "question": "Which scientist invented the lightning rod in history?"
    },
    {
        "question": "Where is the world's largest inland salt lake basin located, and what is its area?"
    },
    {
        "question": "Which animal's eyes can change color, and what is the function of this color change?"
    },
    {
        "question": "In the imperial examination system of ancient China, what was the first-place winner in the provincial examination (Xiang Shi) called?"
    },
    {
        "question": "Where is the world's largest astronomical observatory located, and how many telescopes does it have?"
    },
    {
        "question": "Which plant's stem can be used to make paper, and what are the characteristics of this kind of paper?"
    },
    {
        "question": "Which cultures influenced the famous painter Paul Gauguin in his painting career?"
    },
    {
        "question": "Where is the world's largest underground river cave group located, and how many caves does it include?"
    },
    {
        "question": "Which organ in the human body has the fastest cell renewal rate?"
    },
    {
        "question": "Which animal's horns can be used as medicine, and what are their medicinal values?"
    },
    {
        "question": "What mathematical knowledge does 'Shu' (Numbers), one of the 'Six Arts' (Liu Yi) in ancient China, refer to?"
    },
    {
        "question": "Who is the private collector with the largest meteorite collection in the world, and how many meteorites has he collected?"
    },
    {
        "question": "Which plant's flowers can attract the most insects for pollination, and why?"
    },
    {
        "question": "Which emperor in history initiated the 'Kaiyuan盛世' (Kaiyuan Flourishing Age)?"
    },
    {
        "question": "Where is the world's largest glacier museum located, and what glacier-related contents are exhibited in it?"
    },
    {
        "question": "Which animal's tail serves as a balance tool to help it move in complex terrains?"
    },
    {
        "question": "What is the core ideology of *The Doctrine of the Mean* (Zhong Yong), one of the 'Four Books' (Si Shu) in ancient China?"
    },
    {
        "question": "What is the total drop of the world's largest waterfall group, and where is it located?"
    },
    {
        "question": "Paul Cézanne, the famous painter, is known as the 'Father of Modern Painting'. What are the characteristics of his painting style?"
    },
    {
        "question": "Which plant's leaves can be used as a tea substitute, and what is its taste like?"
    },
    {
        "question": "Where is the world's largest cave passage located, and what are its length and width respectively?"
    },
    {
        "question": "Which organ in the human body is most easily damaged by alcohol?"
    },
    {
        "question": "Which animal can hear ultrasonic waves, and how does it use ultrasonic waves?"
    },
    {
        "question": "Among the 'Twenty-Four Solar Terms' in ancient China, when does the 'Daxue' (Heavy Snow) solar term usually occur in the Gregorian calendar?"
    },
    {
        "question": "Where is the world's largest music museum located, and how many musical instruments are collected in it?"
    },
    {
        "question": "Which plant's fruit can be used to make soap, and what is the production method?"
    },
    {
        "question": "In which country did the world's first steam locomotive run, and how far did it travel?"
    },
    {
        "question": "Which is the world's largest freshwater lake group, and how many lakes does it consist of?"
    },
    {
        "question": "Which animal's tongue secretes a special substance to help it climb smooth surfaces?"
    },
    {
        "question": "Among the 'Four Famous Embroideries' in ancient China, what themes are mainly featured in Xiang Embroidery (Hunan Embroidery)?"
    },
    {
        "question": "Where is the world's largest volcano museum located, and how many types of volcanic specimens are exhibited in it?"
    },
    {
        "question": "How many works are included in Honoré de Balzac's *La Comédie Humaine*?"
    },
    {
        "question": "Which plant's roots can absorb heavy metals from the soil, and what is the effect of this absorption?"
    },
    {
        "question": "Where is the world's largest coral reef tunnel located, and what is its length?"
    },
    {
        "question": "Which organ in the human body is closely related to emotional regulation?"
    },
    {
        "question": "Which animal's teeth grow throughout its life, and how does it prevent its teeth from becoming too long?"
    },
    {
        "question": "In the 'Five Elements Restraint Cycle' (Wu Xing Xiang Ke) of ancient China, which element does 'Tu' (Earth) restrain?"
    },
    {
        "question": "Where is the world's largest desert botanical garden located, and how many species of desert plants are grown in it?"
    },
    {
        "question": "Which plant's flowers can be used as a natural insecticide, and what is the principle behind this?"
    },
    {
        "question": "Which scientist invented the lightning rod in history?"
    },
    {
        "question": "Where is the world's largest inland salt lake basin located, and what is its area?"
    },
    {
        "question": "Which animal's eyes can change color, and what is the function of this color change?"
    },
    {
        "question": "In the imperial examination system of ancient China, what was the first-place winner in the provincial examination (Xiang Shi) called?"
    },
    {
        "question": "Where is the world's largest astronomical observatory located, and how many telescopes does it have?"
    },
    {
        "question": "Which plant's stem can be used to make paper, and what are the characteristics of this kind of paper?"
    },
    {
        "question": "Which cultures influenced the famous painter Paul Gauguin in his painting career?"
    },
    {
        "question": "Where is the world's largest underground river cave group located, and how many caves does it include?"
    },
    {
        "question": "Which organ in the human body has the fastest cell renewal rate?"
    },
    {
        "question": "Which animal's horns can be used as medicine, and what are their medicinal values?"
    },
    {
        "question": "What mathematical knowledge does 'Shu' (Numbers), one of the 'Six Arts' (Liu Yi) in ancient China, refer to?"
    },
    {
        "question": "Who is the private collector with the largest meteorite collection in the world, and how many meteorites has he collected?"
    },
    {
        "question": "Which plant's flowers can attract the most insects for pollination, and why?"
    },
    {
        "question": "Which emperor in history initiated the 'Kaiyuan盛世' (Kaiyuan Flourishing Age)?"
    },
    {
        "question": "Where is the world's largest glacier museum located, and what glacier-related contents are exhibited in it?"
    },
    {
        "question": "Which animal's tail serves as a balance tool to help it move in complex terrains?"
    },
    {
        "question": "What is the core ideology of *The Great Learning* (Da Xue), one of the 'Four Books' (Si Shu) in ancient China?"
    },
    {
        "question": "What is the total drop of the world's largest waterfall group, and where is it located?"
    },
    {
        "question": "Paul Cézanne, the famous painter, is known as the 'Father of Modern Painting'. What are the characteristics of his painting style?"
    },
    {
        "question": "Which plant's leaves can be used as a tea substitute, and what is its taste like?"
    },
    {
        "question": "Where is the world's largest cave passage located, and what are its length and width respectively?"
    },
    {
        "question": "Which organ in the human body is most easily damaged by alcohol?"
    },
    {
        "question": "Which animal can hear ultrasonic waves, and how does it use ultrasonic waves?"
    },
    {
        "question": "Among the 'Twenty-Four Solar Terms' in ancient China, when does the 'Daxue' (Heavy Snow) solar term usually occur in the Gregorian calendar?"
    },
    {
        "question": "Where is the world's largest music museum located, and how many musical instruments are collected in it?"
    },
    {
        "question": "Which plant's fruit can be used to make soap, and what is the production method?"
    },
    {
        "question": "In which country did the world's first steam locomotive run, and how far did it travel?"
    },
    {
        "question": "Which is the world's largest freshwater lake group, and how many lakes does it consist of?"
    },
    {
        "question": "Which animal's tongue secretes a special substance to help it climb smooth surfaces?"
    },
    {
        "question": "Among the 'Four Famous Embroideries' in ancient China, what themes are mainly featured in Xiang Embroidery (Hunan Embroidery)?"
    },
    {
        "question": "In the 'Deep-Sea Bioluminescent Sharks' stamps issued by Tuvalu in 2023, how many letters are there in the Latin name of the species belonging to the genus *Scymnodon*?"
    },
    {
        "question": "In the Marshall Variation of the Scandinavian Defense (a chess opening), what is the starting square of Black's knight on the 9th move?"
    },
    {
        "question": "In the 2024 updated version of ISO 7098, on which page does the alternative printed form of the Chinese Pinyin letter 'ü' appear for the first time?"
    },
    {
        "question": "How many fewer thermally bonded panels are there on the surface of the official training ball 'Al Rihla Pro' for the 2022 FIFA World Cup Qatar compared to the match ball?"
    },
    {
        "question": "What is the diameter (in millimeters) of the drainage holes inside the nose cone of the Japanese Shinkansen N700S series?"
    },
    {
        "question": "In the Unicode 15.1 draft, what is the line number of the comment for the character U+1F6E0?"
    },
    {
        "question": "What is the file size (in bytes) of the experiment log for the 8th test of MOXIE aboard NASA's Perseverance rover on Mars?"
    },
    {
        "question": "How many teeth are there on the edge of the 2023 'Bee' 50p commemorative coin issued by the Royal Mint of the United Kingdom?"
    },
    {
        "question": "In the 2023 Japanese dubbed version of *The Lord of the Rings: The War of the Rohirrim*, how many katakana characters are there in Eowyn's first line of dialogue?"
    },
    {
        "question": "In Section 3.2.1 of Appendix B in the 2023 version of the BWF (Badminton World Federation) Rules, what is the Pantone color code of the net posts mentioned?"
    },
    {
        "question": "What is the version number of the QR code at the bottom right corner of the official poster for the 2024 Paris Olympics?"
    },
    {
        "question": "What is the font size (in points) of the page number at the bottom left corner of Page 174 in the owner's manual for the 2024 Tesla Model Y Long Range version?"
    },
    {
        "question": "How many characters are there in the second line of the care label inside the ribbon of the 2020 Tokyo Paralympics medals?"
    },
    {
        "question": "How many characters are there in the second line of the third paragraph in the 1.2.1 patch notes for *The Legend of Zelda: Tears of the Kingdom*?"
    },
    {
        "question": "How many words are there in the acceptance speech of Evan Goldberg, a winner of the 2023 Academy Award for Technical Achievement?"
    },
    {
        "question": "In the March 2023 bulletin of the Minor Planet Center of the International Astronomical Union (IAU), how many letters are there in the provisional name of the asteroid numbered (2023 FW13)?"
    },
    {
        "question": "How many rows are there in the microlens array of the main camera sensor of the iPhone 15 Pro Max?"
    },
    {
        "question": "What is the width (in millimeters) of the turf seam tape at Lusail Stadium, the venue for the 2022 FIFA World Cup Qatar final?"
    },
    {
        "question": "What is the size (in MB) of the PKG file for the 1.000.005 patch of the PS5 version of *Hogwarts Legacy*?"
    },
    {
        "question": "What is the gain (in dBi) of the S-band antenna planned for use in NASA's 2023 Europa Clipper mission?"
    },
    {
        "question": "How many pixel columns are there in the 6th segment of the on-site LED ring screen at the 2023 League of Legends World Championship?"
    },
    {
        "question": "How many characters are there in the first sentence of the second paragraph in the 1.0.3 patch notes for *Diablo IV*?"
    },
    {
        "question": "How many Poké Ball stickers appear in the end credits illustration of Episode 3 of the 2023 new *Pokémon* anime series?"
    },
    {
        "question": "What is the total number of floor stickers used in the qualifying rounds of Breaking, the new event added to the 2024 Paris Olympics?"
    },
    {
        "question": "How many words are there in the title on Page 12 of the PPT for Louis Brus' Nobel Lecture, where Louis Brus is a winner of the 2023 Nobel Prize in Chemistry?"
    },
    {
        "question": "What is the spacing (in micrometers) between the texture units on the surface of the official match ball 'Al Rihla' for the 2022 FIFA World Cup Qatar?"
    },
    {
        "question": "What is the silk-screened text on the 3rd line of the back of the 3DS cartridge for the 3D version of *The Legend of Zelda: Ocarina of Time*?"
    },
    {
        "question": "How many digits are there in the barcode on the back of the miniature sheet of the 2023 *Harry Potter* commemorative stamps issued by Royal Mail (UK)?"
    },
    {
        "question": "What is the date format in the footer of Page 45 of the 2023 maintenance log for the Zvezda Service Module, the Russian segment of the International Space Station (ISS)?"
    },
    {
        "question": "How many characters are there in the 3rd line of the second paragraph in the 1.2.2 firmware update log for the Sony WH-1000XM5 headphones?"
    },
    {
        "question": "What is the font size (in JIS font size units) of the page number at the bottom left corner of Page 5 in the tankōbon (single volume) of Chapter 1000 of *One Piece*?"
    },
    {
        "question": "What is the residual height (in millimeters) of the injection gate on the transparent shell of 'Bing Dwen Dwen', the mascot of the 2022 Winter Olympics?"
    },
    {
        "question": "How many elbow joints are there in the cooling pipes of the battery pack in the 2024 Tesla Model Y Long Range version?"
    },
    {
        "question": "What is the first letter of the text in the first line of the care label on the ribbon of the 2020 Tokyo Paralympics medals?"
    },
    {
        "question": "How many characters are there in the first sentence of the 4th paragraph in the 1.1.2 patch notes for *The Legend of Zelda: Tears of the Kingdom*?"
    },
    {
        "question": "How many LED beads are there on the backdrop LED screen during the post-match interview of the champion team at the 2023 League of Legends World Championship?"
    },
    {
        "question": "What is the infill density percentage of the 2nd layer in the 3D printing file for the Lilith statue from *Diablo IV*?"
    },
    {
        "question": "How many characters are there in the second line of the first paragraph in the update log for the first part of the 'The Hidden Treasure of Area Zero' DLC for *Pokémon Scarlet and Violet* (2023)?"
    },
    {
        "question": "What is the thickness (in millimeters) of the lining cardboard in the packaging box of the 2024 Paris Olympics torch?"
    },
    {
        "question": "What is the unit of the y-axis in Figure S3 of the supplementary materials for the original research paper on quantum dots by the 2023 Nobel Prize in Chemistry winners?"
    },
    {
        "question": "How many lines of subtitles are there in the 2nd segment of the behind-the-scenes footage on the extended edition Blu-ray of *The Lord of the Rings: The Fellowship of the Ring*?"
    },
    {
        "question": "How many solder joints are there on the LED headlights of the Japanese Shinkansen N700S series?"
    },
    {
        "question": "How many words are there in the comment line for the emoji with the code U+1F6D7 in Unicode 15.0?"
    },
    {
        "question": "What is the millisecond value in the timestamp of the experiment log for the 5th test of MOXIE aboard NASA's Perseverance rover on Mars?"
    },
    {
        "question": "What is the last digit of the mold serial number for the 2023 'Bee' 50p commemorative coin issued by the Royal Mint of the United Kingdom?"
    },
    {
        "question": "In Section 3.2.2 of Appendix B in the 2023 version of the BWF Rules, what is the weight tolerance (in grams) of the net post base mentioned?"
    },
    {
        "question": "How many words are there in Footnote 1 of Chapter 4 in the English translation of the novel *The Three-Body Problem*?"
    },
    {
        "question": "What is the green RGB value of the Agitos symbol in the Paralympics logo on the official poster for the 2024 Paris Olympics?"
    },
    {
        "question": "What is the size (in millimeters) of the icon at the bottom right corner of Page 88 in the owner's manual for the 2024 Tesla Model Y Long Range version?"
    },
    {
        "question": "What is the final punctuation mark in the 3rd line of the care label on the ribbon of the 2020 Tokyo Paralympics medals?"
    },
    {
        "question": "How many characters are there in the first sentence of the 5th paragraph in the 1.2.0 patch notes for *The Legend of Zelda: Tears of the Kingdom*?"
    },
    {
        "question": "How many lines of engraving are there on the base of the trophy for the 2023 Academy Award for Technical Achievement?"
    },
    {
        "question": "In the August 2023 bulletin of the International Astronomical Union (IAU), to how many decimal places is the perihelion distance of Comet C/2023 P1 specified?"
    },
    {
        "question": "What is the radius of curvature (in micrometers) of the microlenses in the main camera sensor of the iPhone 15 Pro Max?"
    },
    {
        "question": "What is the Pantone color code of the turf seam tape at Lusail Stadium, the venue for the 2022 FIFA World Cup Qatar final?"
    },
    {
        "question": "What are the first 4 digits of the MD5 hash value of the PKG file for the 1.000.006 patch of the PS5 version of *Hogwarts Legacy*?"
    },
    {
        "question": "What is the gain (in dBi) of the Ka-band antenna planned for use in NASA's 2023 Europa Clipper mission?"
    },
    {
        "question": "How many pixel rows are there in the 9th segment of the on-site LED ring screen at the 2023 League of Legends World Championship?"
    },
    {
        "question": "How many characters are there in the second sentence of the 3rd paragraph in the 1.0.4 patch notes for *Diablo IV*?"
    },
    {
        "question": "How many types of Poké Balls appear in the end credits illustration of Episode 7 of the 2023 new *Pokémon* anime series?"
    },
    {
        "question": "What is the height (in centimeters) of the DJ booth used in the qualifying rounds of Breaking, the new event added to the 2024 Paris Olympics?"
    },
    {
        "question": "How many characters are there in the title on Page 7 of the PPT for Pierre Agostini's Nobel Lecture, where Pierre Agostini is a winner of the 2023 Nobel Prize in Physics?"
    },
    {
        "question": "What is the height (in micrometers) of the texture units on the surface of the official training ball 'Al Rihla Pro' for the 2022 FIFA World Cup Qatar?"
    },
    {
        "question": "What is the silk-screened text on the 4th line of the back of the cartridge for the 3D version of *The Legend of Zelda: Ocarina of Time*?"
    },
    {
        "question": "What is the version number of the QR code on the back of the miniature sheet of the 2023 *Harry Potter* commemorative stamps issued by Royal Mail (UK)?"
    },
    {
        "question": "What is the font size (in points) of the page number in the footer of Page 50 of the 2023 maintenance log for the Zvezda Service Module, the Russian segment of the International Space Station (ISS)?"
    },
    {
        "question": "How many characters are there in the 4th line of the first paragraph in the 1.2.3 firmware update log for the Sony WH-1000XM5 headphones?"
    },
    {
        "question": "What is the font size (in JIS font size units) of the page number at the bottom right corner of Page 6 in the tankōbon of Chapter 1000 of *One Piece*?"
    },
    {
        "question": "What is the angle (in degrees) of the position of the injection gate on the transparent shell of 'Bing Dwen Dwen', the mascot of the 2022 Winter Olympics?"
    },
    {
        "question": "What is the radius of curvature (in millimeters) of the elbow joints in the cooling pipes of the battery pack in the 2024 Tesla Model Y Long Range version?"
    },
    {
        "question": "What is the final letter of the text in the second line of the care label on the ribbon of the 2020 Tokyo Paralympics medals?"
    },
    {
        "question": "How many characters are there in the first sentence of the 6th paragraph in the 1.1.1 patch notes for *The Legend of Zelda: Tears of the Kingdom*?"
    },
    {
        "question": "How many LED strips are there on the backdrop during the post-match interview of the champion team at the 2023 League of Legends World Championship?"
    },
    {
        "question": "What is the infill angle (in degrees) of the 3rd layer in the 3D printing file for the Lilith statue from *Diablo IV*?"
    },
    {
        "question": "How many characters are there in the first line of the second paragraph in the update log for the second part of the 'The Hidden Treasure of Area Zero' DLC for *Pokémon Scarlet and Violet* (2023)?"
    },
    {
        "question": "How many digits are there in the barcode on the outer label of the packaging box of the 2024 Paris Olympics torch?"
    },
    {
        "question": "How many rows are there in Table S2 of the supplementary materials for the original research paper on quantum dots by the 2023 Nobel Prize in Chemistry winners?"
    },
    {
        "question": "How many characters are there in the subtitles of the 3rd segment of the behind-the-scenes footage on the extended edition Blu-ray of *The Lord of the Rings: The Fellowship of the Ring*?"
    },
    {
        "question": "What is the spacing (in millimeters) between the solder pads of the LED headlights of the Japanese Shinkansen N700S series?"
    },
    {
        "question": "How many characters are there in the comment line for the emoji with the code U+1F6D6 in Unicode 15.0?"
    },
    {
        "question": "What is the second value in the timestamp of the experiment log for the 11th test of MOXIE aboard NASA's Perseverance rover on Mars?"
    },
    {
        "question": "How many times is the mold polished for the 2023 'Bee' 50p commemorative coin issued by the Royal Mint of the United Kingdom?"
    },
    {
        "question": "In Section 3.2.3 of Appendix B in the 2023 version of the BWF Rules, what is the screw specification of the net post base mentioned?"
    },
    {
        "question": "How many words are there in Footnote 2 of Chapter 6 in the English translation of the novel *The Three-Body Problem*?"
    },
    {
        "question": "What is the black RGB value of the Agitos symbol in the Paralympics logo on the official poster for the 2024 Paris Olympics?"
    },
    {
        "question": "What is the Pantone color code of the icon at the bottom left corner of Page 112 in the owner's manual for the 2024 Tesla Model Y Long Range version?"
    },
    {
        "question": "What is the first letter of the text in the 4th line of the care label on the ribbon of the 2020 Tokyo Paralympics medals?"
    },
    {
        "question": "How many characters are there in the first sentence of the 7th paragraph in the 1.2.2 patch notes for *The Legend of Zelda: Tears of the Kingdom*?"
    },
    {
        "question": "What is the font size (in points) of the engraving on the base of the trophy for the 2023 Academy Award for Technical Achievement?"
    },
    {
        "question": "In the September 2023 bulletin of the International Astronomical Union (IAU), to how many decimal places is the absolute magnitude of the near-Earth asteroid 2023 QX specified?"
    },
    {
        "question": "What is the spacing (in micrometers) between the microlenses in the main camera sensor of the iPhone 15 Pro Max?"
    },
    {
        "question": "What is the width tolerance (in millimeters) of the turf seam tape at Lusail Stadium, the venue for the 2022 FIFA World Cup Qatar final?"
    },
    {
        "question": "What are the last 4 digits of the SHA256 hash value of the PKG file for the 1.000.007 patch of the PS5 version of *Hogwarts Legacy*?"
    },
    {
        "question": "What is the gain (in dBi) of the X-band antenna planned for use in NASA's 2023 Europa Clipper mission?"
    },
    {
        "question": "How many pixel columns are there in the 12th segment of the on-site LED ring screen at the 2023 League of Legends World Championship?"
    },
    {
        "question": "How many characters are there in the first sentence of the 4th paragraph in the 1.0.5 patch notes for *Diablo IV*?"
    },
    {
        "question": "How many colors of Poké Ball stickers appear in the end credits illustration of Episode 10 of the 2023 new *Pokémon* anime series?"
    },
    {
        "question": "What is the side length (in centimeters) of the floor stickers used in the qualifying rounds of Breaking, the new event added to the 2024 Paris Olympics?"
    },
    {
        "question": "How many words are there in the title on Page 9 of the PPT for Ferenc Krausz's Nobel Lecture, where Ferenc Krausz is a winner of the 2023 Nobel Prize in Physics?"
    },
    {
        "question": "What is the spacing tolerance (in micrometers) between the texture units on the surface of the official training ball 'Al Rihla Pro' for the 2022 FIFA World Cup Qatar?"
    }
]